## In-Class Exercise 1

In [1]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [23, 35, 45, 36, 28],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix']
}

df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   23     New York
1      Bob   35  Los Angeles
2  Charlie   45      Chicago
3    David   36      Houston
4      Eva   28      Phoenix

In [2]:
# Task 1
df.iloc[2]

Name    Charlie
Age          45
City    Chicago
Name: 2, dtype: object

In [3]:
# Task 2
df.iloc[:, 1]

0    23
1    35
2    45
3    36
4    28
Name: Age, dtype: int64

In [4]:
# Task 3
df.iloc[0:3]

      Name  Age         City
0    Alice   23     New York
1      Bob   35  Los Angeles
2  Charlie   45      Chicago

In [5]:
# Task 4
df.iloc[0:3, [0, 2]]

      Name         City
0    Alice     New York
1      Bob  Los Angeles
2  Charlie      Chicago

In [6]:
# Task 5
df.loc[2]

Name    Charlie
Age          45
City    Chicago
Name: 2, dtype: object

In [7]:
# Task 6
df.loc[:, 'Age']

0    23
1    35
2    45
3    36
4    28
Name: Age, dtype: int64

In [8]:
# Task 7
df.loc[[1, 4], 'City']

1    Los Angeles
4        Phoenix
Name: City, dtype: object

## In-Class Exercise 2

In [9]:
# Task 1
df[df.loc[:, 'Age'] > 30]

      Name  Age         City
1      Bob   35  Los Angeles
2  Charlie   45      Chicago
3    David   36      Houston

In [14]:
# Task 2
df[df.loc[:, 'City'] == ('Chicago' or 'Houston')]

      Name  Age     City
2  Charlie   45  Chicago

In [16]:
# Task 3
name_index_df = df.set_index('Name')

name_index_df.loc['David']

Age          36
City    Houston
Name: David, dtype: object

In [17]:
# Task 4

name_index_df.loc[['Bob', 'Eva'], ['Age', 'City']]

      Age         City
Name
Bob    35  Los Angeles
Eva    28      Phoenix

## In-Class Exercise 3

In [27]:
data = {
    'Product': ['Apple', 'Banana', 'Carrot', 'Doughnut', 'Egg'],
    'Price': [0.5, 0.3, 0.4, 1.0, 0.2],
    'In Stock': [True, True, False, True, False]
}

df = pd.DataFrame(data)
df

    Product  Price  In Stock
0     Apple    0.5      True
1    Banana    0.3      True
2    Carrot    0.4     False
3  Doughnut    1.0      True
4       Egg    0.2     False

In [28]:
# Task 1
df[df.loc[:, 'In Stock'] == True]

    Product  Price  In Stock
0     Apple    0.5      True
1    Banana    0.3      True
3  Doughnut    1.0      True

In [29]:
# Task 2
df.loc[3, 'Price'] = 1.2
df

    Product  Price  In Stock
0     Apple    0.5      True
1    Banana    0.3      True
2    Carrot    0.4     False
3  Doughnut    1.2      True
4       Egg    0.2     False

In [30]:
# Task 3
df[df.loc[:, 'Price'] < 0.5]

  Product  Price  In Stock
1  Banana    0.3      True
2  Carrot    0.4     False
4     Egg    0.2     False

In [39]:
# Task 4
df.loc[(df.loc[:, 'In Stock'] == False), ['Product', 'Price']]

  Product  Price
2  Carrot    0.4
4     Egg    0.2